{
  "ques_identifier": "31_primary",
  "methods": [
    {
      "methodName": "Method 1: Proof using tangent properties and parallelogram properties",
      "markingPoints": [
        {
          "stepId": "1",
          "MarkType": "B",
          "marks": "0.5",
          "Teacher Expectation": "Draw a diagram of a parallelogram ABCD circumscribing a circle, marking the points of tangency on each side. State the theorem: \"Tangents drawn from an external point to a circle are equal in length.\"",
          "Pass if": "A correct diagram of a parallelogram circumscribing a circle is drawn, with points of tangency clearly marked, and the theorem regarding equal tangents from an external point is accurately stated.",
          "Fail if": "The diagram is incorrect, points of tangency are not marked, or the tangent theorem is stated incorrectly or omitted.",
          "guidance": "Award B1 for a correct diagram showing the parallelogram circumscribing a circle with points of tangency marked, and for stating the tangent theorem 'Tangents drawn from an external point to a circle are equal in length' (soi)."
        },
        {
          "stepId": "2",
          "MarkType": "M",
          "marks": "0.5",
          "Teacher Expectation": "Apply the tangent theorem to express the sides of the parallelogram in terms of equal tangent segments originating from each vertex.",
          "Pass if": "Correctly identifies and states the equality of tangent segments from each vertex (e.g., AP = AS, BP = BQ, CQ = CR, DR = DS).",
          "Fail if": "Any pair of equal tangent segments is incorrectly identified or omitted.",
          "guidance": "Award M1 for correctly applying the tangent theorem to express segments from each vertex (e.g., AP = AS, BP = BQ, CQ = CR, DR = DS) (soi)."
        },
        {
          "stepId": "3",
          "MarkType": "M",
          "marks": "0.5",
          "Teacher Expectation": "Use the property that opposite sides of a parallelogram are equal (AB = CD and BC = DA). Substitute the expressions for the sides, formed by the tangent segments from Step 2, into these equalities.",
          "Pass if": "Correctly states the sides in terms of tangent segments (e.g., AB = AP + PB) and sets up the equations from opposite sides being equal (e.g., AP + PB = CR + DR and BQ + QC = DS + SA).",
          "Fail if": "Incorrectly states the sides or the parallelogram property, or fails to substitute correctly.",
          "guidance": "Award M1 for correctly stating the property of a parallelogram that opposite sides are equal (e.g., AB = CD, BC = DA) and substituting the tangent segment expressions (e.g., AP + PB = CR + DR) (soi)."
        },
        {
          "stepId": "4",
          "MarkType": "M",
          "marks": "1",
          "Teacher Expectation": "Algebraically demonstrate that the parallelogram's sides are all equal by using the tangent segment equalities and the property of opposite sides being equal.",
          "Pass if": "Correctly manipulates the equations derived from parallelogram properties (e.g., AP + PB = CR + DR and BQ + QC = DS + SA) using the tangent segment equalities (e.g., AP = AS, BP = BQ, CQ = CR, DR = DS) to demonstrate that adjacent sides are equal (e.g., by showing AP = CR, or AB = BC).",
          "Fail if": "The algebraic manipulation is incorrect or does not lead to the equality of adjacent sides.",
          "guidance": "Award M1 for correct algebraic manipulation using the tangent segment equalities and parallelogram properties to demonstrate that adjacent sides are equal (e.g., AP + PB = AS + BQ, and since AP=AS, PB=BQ, then AB=BC) (www, ecf)."
        },
        {
          "stepId": "5",
          "MarkType": "A",
          "marks": "0.5",
          "Teacher Expectation": "Conclude that since the parallelogram has all sides equal (as demonstrated in Step 4), it is a rhombus.",
          "Pass if": "Correctly concludes that the parallelogram is a rhombus based on the derived equality of all its sides.",
          "Fail if": "The conclusion is not drawn, or the conclusion is incorrect.",
          "guidance": "Award A1 for the correct conclusion that the parallelogram is a rhombus because all sides are equal (cao)."
        }
      ]
    }
  ],
  "Question_specific_notes": "Ensure students correctly state the tangent theorem and apply it to all vertices. The core of the proof lies in the algebraic manipulation (Step 4) which demonstrates the equality of adjacent sides. Award follow-through (ecf) for marks M and A if an error is made in earlier steps but the subsequent logic is sound."
}